{
  "summary": "The creator discusses how to travel to Europe on a budget, suggesting that saving $80 per week can lead to a European vacation. They explain the importance of traveling during the off-season, specifically March-April or September-October, to avoid higher prices. The video demonstrates how to search for flights on Delta, highlighting the benefits of flexible dates and selecting flights with fewer layovers. It also shows how to find affordable hotels on Hotels.com by filtering for 3- and 4-star properties and a good guest rating. Finally, the creator covers transportation options in Paris, recommending the use of public transport passes like Navigo over Ubers for cost savings, and suggests budgeting for food and activities.",
  "content_theme": [
    "Travel",
    "Budget Travel",
    "Personal Finance"
  ],
  "content_style": [
    "Tutorials",
    "Vlogs",
    "How-To Guides"
  ],
  "creator_presence": [
    "Face only"
  ],
  "on_screen_text": [
    "how I turned $80/week into a European vacation (multiple times!)",
    "$80 x 52 weeks = $4,160 a year",
    "March-April",
    "September-October",
    "CMH",
    "PAR",
    "Columbus, OH",
    "Paris Area Airports, France",
    "Thu, Apr 16 - Thu, Apr 23",
    "2 Passengers",
    "Shop With Miles",
    "My Dates Are Flexible",
    "Exclude Miles",
    "Refundable",
    "Advanced Search",
    "Best Fares For",
    "Delta Main Basic",
    "Find Flights",
    "1 Stop | JFK",
    "12h 15m",
    "6:00 PM",
    "12:15 PM",
    "Thu, Apr 16",
    "CDG",
    "Operated by Republic Airways Delta Connection.",
    "Delta Main",
    "Round Trip From",
    "$523",
    "Details",
    "Seats",
    "DL5650",
    "DL264",
    "DL1522, DL82",
    "12:29 PM",
    "11h 46m",
    "6:15 AM",
    "$713",
    "Main Basic",
    "All the Essentials",
    "FREE",
    "Cancel for partial eCredit, changes allowed for a fee",
    "Board in Zone 8, limited overhead bin space",
    "Ineligible to earn miles",
    "Ineligible for upgrades",
    "Seat(s) assigned after they cannot change seat",
    "View All Restrictions",
    "Accept Rules",
    "Round Trip From",
    "$523",
    "Select",
    "Most Popular",
    "$749",
    "Experience selection applies to your trip.",
    "View Terms and Conditions",
    "TOTAL PRICE",
    "$2.00 USD",
    "DL YR SURCHARGE",
    "$310.00 USD",
    "DL YQ SURCHARGE",
    "$20.00 USD",
    "DL YR SURCHARGE",
    "$310.00 USD",
    "TAXES, FEES AND CHARGES",
    "$404.26 USD",
    "TOTAL (2 PASSENGERS)",
    "$1,046.26 USD",
    "Pay as low as $100.12/mo including fee with Plan it.",
    "Terms apply",
    "Changeable",
    "TICKETS ARE NONREFUNDABLE",
    "CONTRACT OF CARRIAGE",
    "CALCULATE BAGGAGE RATE",
    "PAYMENT",
    "MY WALLET",
    "ADD A NEW CARD",
    "PLAN IT BY AMERICAN EXPRESS",
    "Add Plan",
    "Hotels.com",
    "Hôtel Dalila",
    "Paris",
    "Wonderful",
    "136 reviews",
    "$119 OFF",
    "$121 nightly",
    "$1,289",
    "$1,171 total",
    "Total with taxes and fees",
    "Hôtel Bastille",
    "Good",
    "We have 6 left at $272 off at",
    "$123 nightly",
    "$1,189 total",
    "Source Hotel",
    "4 stars",
    "3 stars",
    "See more",
    "Neighborhood",
    "Paris",
    "Paris (and vicinity)",
    "Paris City Center",
    "Guest rating",
    "Any",
    "Wonderful 9+",
    "Very good 8+",
    "Good 7+",
    "224 available properties",
    "Done",
    "RESERVER",
    "hotel dalila.com",
    "Apr 16 - Apr 23, 2026",
    "Dalila Cosy Double room",
    "from US$133 / night",
    "instead of US$147 / night",
    "CHECK IN",
    "CHECK OUT",
    "After 3:00 PM",
    "Before 12:00 PM",
    "16 Apr 2026",
    "23 Apr 2026",
    "7 nights",
    "Room details",
    "Prepaid Rate",
    "US$927.47",
    "US$1,030.52",
    "Show details",
    "Total saving",
    "US$103.05",
    "Total",
    "US$927.47",
    "(VAT and taxes included)",
    "Pay now",
    "US$927.47",
    "You will be charged in the hotel's currency. The final price might slightly vary due to the bank's conversion.",
    "hotels.com - Private",
    "Electric",
    "DL 8465 lands at 2:00 PM, Wed, Mar 18",
    "$40.06",
    "UberX",
    "$40.06",
    "Ubers (to and from airport): ~$120",
    "$101.47",
    "Comfort",
    "$52.90",
    "Apple Pay",
    "Reserve Electric",
    "€90.80* per month",
    "*all zones",
    "BUS",
    "M",
    "RER",
    "navigo",
    "Available on mobile phone",
    "Weekly Navigo travel passes",
    "Do you wish to enjoy unlimited travel week? The weekly Navigo...",
    "€32.40* per week",
    "*all zones",
    "ratp.fr",
    "Le Bistro des Augustins",
    "4.5 (2.4K)",
    "€10-20",
    "French restaurant",
    "Open",
    "Overview",
    "Menu",
    "Reviews",
    "Photos",
    "About",
    "Call",
    "Directions",
    "Share",
    "Save",
    "menu",
    "reviews",
    "Laid-back place with sofas & a patio, serving typical bistro fare like toasties & salads, plus wine.",
    "Outdoor",
    "bistro des augustins",
    "HÔTEL",
    "DALILA",
    "PARIS",
    "RESERVER",
    "MAP OF PARIS",
    "Hotels.com",
    "leftover: $1,986.27",
    "PREPARE YOUR VISIT",
    "louvre.fr",
    "ticketed items/experiences: $70 a day or $490 for the week",
    "leftover: $1,496.27",
    "leftover: $500!",
    "breakfast:",
    "$40ish per day, or $300 per week",
    "breakfast:",
    "$20 per day, or $140 per week",
    "leftover: $1,056.27",
    "leftover: $500!"
  ],
  "key_video_elements": [
    "Creator",
    "Technology",
    "Text/Graphics",
    "Food"
  ],
  "brand_safety": [
    "Family-friendly"
  ],
  "brand_type": [
    "Tech brands",
    "Travel/hospitality brands"
  ],
  "brand_names": [
    "Delta",
    "Hotels.com",
    "Uber",
    "Apple Pay",
    "Navigo",
    "RATP"
  ],
  "transcript": "Some of you do not believe me that $80 a week will get you a European vacation. But that's not true because I've done it multiple times. So let me show you how I do it. Firstly, let's just crunch the big numbers. $80 a week for 52 weeks will get you $4,160 a year. Now the question I always get is, is that enough for a European vacation? People seem to think everybody's spending 10, 20, 30,000 dollars to go to Europe. But that's not true. I've gone to Europe multiple times and I've never spent more than $4,000. And I'm not staying at hostels, room sharing or flying a flight with 17 layovers. It's easier than you think if you know where to look. The first thing you need to know about booking a flight to Europe is that Europe is like Disney. If you want to go in the dead of summer or you want to go over Christmas, it's going to be expensive. We have saved thousands of dollars by traveling on the off season. But that doesn't mean that we're traveling in the dead of winter. We've found the best windows to travel are March through April or September through October. Those are months that are still beautiful and great weather for walking around cities. But you're not paying the hefty fees associated with going in June or July. Next you have to know how to find the best deals on flights and hotels. So let me show you how to do that using an example trip. Two people had to de Paris this April. The first thing you need to do is look at flights. I'm using Delta, and I'm just using Delta because it's what I fly all the time. I'm sure if you shop around, you can find maybe even better deals, but sometimes they come with weird layovers like Canadian Air usually does like two different layovers. And I don't mess with that. So let me show you what filters I put in. First, I just put some example dates a Thursday to Thursday. So it's a week long trip. And we're doing Columbus to Paris. Any of the airports doesn't really matter. The important part is we're selecting My Dates Are Flexible. Because when we're just planning, we don't know what dates we want to go yet. We'll base the specific dates of our vacation on what flights are the cheapest. You can see I put in Thursday April 16th through Thursday April 23rd. It's a week. But it's actually cheaper to depart a day earlier by about $200. And that's fine with me. So I'm going to select that. So the cheapest flight leaves from Columbus at 6:00 PM and has you arriving around lunchtime the next day in Paris at 12:15 PM. The price that you see is including taxes, but it is for Main Basic. So if you want to upgrade, you can. I think Main Basic is fine. It's totally fine. I just love Delta's loyalty program, so I probably would upgrade, but that's just me. For flights, round trip, you're paying $1,046.26. That's pretty great for an international flight. Next, we're going to go to hotels.com on a private browser mode. But we're not going to book at hotels.com. We just need to get some info and then book directly on the hotel's website. So you type in my location and dates. We need seven nights in Paris. We want to be in Paris, not Paris and vicinity. And we don't want to be in the suburbs. So you can see the prices listed are for 3 or 4 stars. I typically don't stay at anything lower than a three star just because I like some of the amenities and I like a hotel to look a little nice and feel safe. But I'm fine with not staying at a five star hotel. So to me, four and three stars are the sweet spots. And the other thing that I select is a guest rating of very good or above. These are your reviews from hotels.com. People telling you whether it's a good place to stay or not. Once you get past like seven or six, it just starts to get a little seedy. And I just want to save myself time and weed out some places that wouldn't be a good fit for me. So the hotels listed here are around $118 to $121 nightly. We have two left at $444 at, but we can do better. So let's look at this hotel here. This is a really cute hotel. I just use this as an example, but I'm about to bookmark this for my next trip. I went ahead and put in all of our dates and just selected the lowest room. Because they don't need anything fancy. So the price for the week is $927.47. That's a total saving of $103.05. You can see here. That means with our flight and our hotel, we now have a leftover total of $2,186.27. Next, let's talk transportation. The one time I really think you should splurge on an Uber is either coming from the airport to the hotel or back from the hotel to the airport. Ubers to and from airport, about $120. This is because you just got off the plane, you're tired, you've got all your luggage and you just don't want to mess with public transport. When you have all of your bags, it's just too much. You're tired, you just got off the plane. It's worth the splurge. So info from our flight and our hotel, and mapped out an Uber for about the time that we'd land. It looks like that's going to be about $40. But just to be safe, I would budget about $60 one way for each Uber trip, giving you about $120 to spend on those Ubers to and from the airport. For the rest of your trip, if you're in Europe, please take advantage of their fantastic public transit systems. These are just two examples of what public transport passes look like. This is a 32 euro or about $40 weekly travel pass that will get you access to all of their metros, buses, trains and trams in the larger Paris area. And that's true for most cities that you're going to visit in Europe. So let's budget out about $40 per person for a week of transport, not including those Ubers. So in this example, we're left with about $1,986.27 to feed and entertain ourselves for the week, which is going to be pretty easy. The Eiffel Tower is going to spend you about $15 per person. The Luxembourg Gardens are free. Sacré-Cœur is free. There's lots of cheaper and free things to do. But just to be safe, let's budget about $70 a day or $490 for the week on ticketed items/experiences. So maybe one museum a day or the Eiffel Tower and then a tour. In total, that's about $490 on experiences. Our last required expense is eating. Now I like to eat good on vacation, especially because we like to cook at home during the week. I'm not here to eat McDonald's in the morning. I'm here to spend on some good food, especially if I'm in a different country. So I'll show you an example of what one of their menus looks like. This is a French bistro. It's about 10 to 20 euros per person, but that's if you want to splurge. You can also get a glass of wine for about $5. Give or take. So give or take about $15 per person for food. And I would definitely budget $15 per person for food each day, or $105 for the week. You can also do one nice dinner for $200, plus $50 times six on casual dinners, equals $500. That $500 for the week of dinners. That leaves you with $500 leftover. So you can splurge on something fun like seeing a show or getting a massage. Or if you're like me, and you want to spend about $10 a day on vintage and thrift stores. I spent about $10 a day on breakfast, so coffee, pastries at a local patisserie. That's about $20 for the both of us each day for seven days, that's about $140. Then lunch would usually be at a sit-down cafe. There's so many cute ones in Paris and honestly, all over Europe. And I'll show you an example of what one of their menus looks like. That's about $20 per day, or $140 per week. And then you could do one nice dinner for $200, plus $50 times six on casual dinners equals $500. That leaves you with $500 leftover. So you can splurge on something fun like seeing a show or getting a massage. Or if you're like me, and you want to spend about $10 a day on vintage and thrift stores. The point of this video is not to tell you that you have to do our exact travel plans, but it is to show you that it's easier than you think to travel on a budget. When you do some digging and get a little creative. I talked about this in my last video, but I'm actually headed to Mexico City for about $3,000 total for a week. I am so, so excited. So if you have any rex, please let me know and let me know if you want to see more travel content."
}