{
  "summary": "The video shows a makeup artist applying makeup to a woman. The artist applies primer, eyeshadow, eyeliner, and mascara to the woman's eyes. They also apply foundation, concealer, blush, and contour to the woman's face. The artist then applies lip liner, lipstick, and lip gloss to the woman's lips. The video ends with the woman looking at the camera.",
  "content_theme": [
    "Beauty",
    "Makeup Tutorials"
  ],
  "content_style": [
    "Tutorials",
    "Demonstration",
    "Vlogs"
  ],
  "creator_presence": [
    "Hands-only",
    "Creator-centric",
    "Partial visibility"
  ],
  "on_screen_text": [],
  "key_video_elements": [
    "Creator",
    "Beauty Products"
  ],
  "brand_safety": [
    "Family-friendly"
  ],
  "brand_type": "Multiple brands featured",
  "brand_names": [
    "Huda Beauty",
    "MAC"
  ],
  "transcript": "Honestly, this is probably one of my favorite glam looks that I've done so far. Keep watching to see how I've done it. Also, guys, I'm offering one-on-one lessons, so reach out to me on Instagram if you're interested. First things first, always prepping the eyelids with some concealer, setting it down with powder. I'm just going in with a few transition shades. I'm focusing them on the outer corner of the eye and then slightly dragging it through. I build them up first to the intensity that I like before I move on to the darker color. Now I'm intensifying the eye makeup with some black shadow and a bit of liner, smudging it out and making sure it's all blended. I've also made custom lash using individual lashes from SHEIN. At this point, her eyes are still matte because I wasn't sure if I wanted to add shimmer. For foundation, I used House Labs and Anastasia Beverly Hills foundation. And blush, I've used Morphe and the Made by Mitchel curve case. This is like my favorite part of the makeup because I feel like you can really see everything coming together now with the contour and the concealer and the blush placement, it's all coming together so nicely. It's looking so flawless and smooth. I'm just bronzing her up now. I'm just reinforcing everything that I've done with cream, but with powder now. With the blush, I'll use like five different blushes. I'll use a matte blush, a shimmery blush, and I just find that you get the perfect finish like that. For her lower lash line, I'm just using the same colors that I used for her eye shadow. For the shimmer, I used the House Labs highlighter. And now for her lips, I used the Spiffy from Morphe and just a bit of gloss from Maybelline. Honestly, this is just one of my favorite glam looks. It's just so stunning, so elegant, still glam without being too crazy. I'm obsessed. It's so flawless and smooth. I'm just bronzing her up now. I'm just reinforcing everything that I've done with cream, but with powder now. With the blush, I'll use like five different blushes. I'll use a matte blush, a shimmery blush, and I just find that you get the perfect finish like that. For her lower lash line, I'm just using the same colors that I used for her eye shadow. For the shimmer, I used the House Labs highlighter. And now for her lips, I used the Spiffy from Morphe and just a bit of gloss from Maybelline. Honestly, this is just one of my favorite glam looks. It's just so stunning, so elegant, still glam without being too crazy. I'm obsessed."
}