{
  "summary": "A makeup artist applies makeup to a model's face. The process includes applying eyeshadow, eyeliner, foundation, blush, and lipstick. The artist also applies false lashes and highlights the model's face and nose. A setting spray is used at the end.",
  "content_theme": "Beauty, Makeup Tutorials",
  "content_style": "Tutorials, How-To Guides",
  "creator_presence": "Creator-centric, Face only",
  "on_screen_text": [],
  "key_video_elements": [
    "Creator",
    "Product",
    "Text/Graphics",
    "Beauty Products"
  ],
  "brand_safety": [
    "Family-friendly"
  ],
  "brand_type": "Multiple brands featured",
  "brand_names": [
    "Huda Beauty",
    "MAC",
    "Hourglass"
  ],
  "transcript": "Honestly, this is probably one of my favorite glam looks that I've done so far. Keep watching to see how I've done it. Also, guys, I'm offering one-on-one lessons. So reach out to me on Instagram if you're interested.\nFirst things first, always prepping the eyelids with some concealer, setting it down with powder.\nI'm just going in with a few transition shades. I'm focusing them on the outer corner of the eye and then just slightly dragging it through.\nI build them up first to the intensity that I like before I move on to the darker color.\nNow, I'm intensifying the eye makeup with some black shadow and a bit of liner, smudging it out and making sure it's all blended.\nI've also made custom lashes using individual lashes from\nAt this point, her eyes are still matte because I wasn't sure if I wanted to add shimmer. I do add shimmer in the end.\nFull foundation. I used Haus Labs and Estee Lauder.\nAnd blush, I've used Morphe and the Maybelline.\nThis is like my favorite part of the makeup because I feel like you can really see everything coming together now with the contour and the concealer and the blush placement. It's all coming together so nicely.\nNever neglect a little bit of nose contour. It really does make a difference.\nNow, I'm just blending away any creases and then setting it with the Huda Beauty Easy Bake powder in the shade pound cake.\nObviously, you can just see it's all coming together so nicely. It's looking so flawless and smooth.\nI'm just bronzing her up now.\nI'm just reinforcing everything that I've done with cream, but with powder now.\nWith the blush, I'll use like five different blushes, a matte blush, a shimmery blush.\nI just find that you get the perfect finish like that.\nFor her lower lash line, I'm just using the same colors that I used for her eyeshadow.\nFor the shimmer, I used the Haus Labs highlighter.\nAnd now for her lips, I used Spiffy from Morphe and I also used Honey Love from MAC and just a bit of gloss from Maybelline.\nHonestly, this is just one of my favorite glam looks. It's just so stunning, so elegant, still glam without being too crazy. I'm obsessed."
}