{
  "summary": "The video shows a person spearfishing in South Florida. The creator explains that it's important to hide behind rocks or coral when hunting to avoid being seen by the fish. They encounter a school of fish but are unable to spear them as they are protected. Later, they spot a hogfish and attempt to catch it, but it escapes. The creator notes that this hogfish is delicious and needs to be at least 16 inches long, but this one is too small.",
  "content_theme": [
    "Travel",
    "Food",
    "DIY/Crafts"
  ],
  "content_style": [
    "Vlogs",
    "Storytelling",
    "How-To Guides"
  ],
  "creator_presence": [
    "Creator-centric",
    "Full body",
    "Face only",
    "Voice-only"
  ],
  "on_screen_text": [
    "Location: South Florida",
    "Catching My Food"
  ],
  "key_video_elements": [
    "Creator",
    "Food",
    "Nature",
    "Technology",
    "Props",
    "Text/Graphics"
  ],
  "brand_safety": [
    "Family-friendly",
    "Mild language"
  ],
  "brand_type": [
    "No brands featured"
  ],
  "brand_names": [],
  "transcript": "Catching my food. Whenever you're hunting, you want to make sure that you're hiding behind any rock or coral so that the fish that you want to eat doesn't see you. I locked onto a large parrot fish and while these guys do look big and tasty, you're not allowed to spear them because they're protected here in Florida. As I was following it, I ran out of air so I decided to swim to the top. And from the top of the water, I saw a massive school of fish. Sometimes there's something tasty hiding in the school, so I went down to take a closer look. But when I didn't find anything, I waved them off and continued my search for what could be my breakfast. I stumbled across the most delicious fish in the sea, which is a lionfish, and when I took aim, I needed to make sure that I hit it good because these guys are destroying South Florida. That one fish wasn't going to be enough to feed me though, so I had to be extra stealthy. As I went across the bottom of the sea floor, looking for what else I can eat. I swam up to this hogfish that thought it was completely camouflage, and when it realized that I saw it, it turned its camouflage off and slowly started swimming away from me. Well, this fish is delicious. It has to be a minimum of 16 inches, and this guy is just a little too small."
}