{
  "summary": "The video is a review of the Xiaomi 17 Promax phone. The reviewer demonstrates the zoom capabilities of the rear camera, notes that the zoom is good and HD, and highlights the screen on the back as a favorite feature. The reviewer also compares the video quality of the Xiaomi phone to an iPhone 12 Pro Max, noting differences in color contrast. The video concludes with the reviewer expressing satisfaction with the phone's quality and performance, calling it the 'best decision' they made.",
  "content_theme": "Technology, Gadget Reviews",
  "content_style": "Reviews, Tutorials",
  "creator_presence": "Creator-centric, Face only, Full body",
  "on_screen_text": [
    "My Review On",
    "Xiaomi 17 Promax",
    "Move farther away",
    "1.1x",
    "2.5x",
    "zoom ability is good for me!!",
    "4.7x",
    "6.5x",
    "cuteee?!?! 🥺🥺",
    "cam xiaomi 17 promax:",
    "cam iphone 12 pro max:",
    "kalian bisa liat sendiri perbedaan warnanya:",
    "HD & jernih tapi ga fokus ke",
    "pori-pori / makeup cakey!",
    "zoom lebih smooth & stabil",
    "ini quality and warna back camera!",
    "best decision I made!! ✨💖"
  ],
  "key_video_elements": [
    "Creator",
    "Technology",
    "Product",
    "Text/Graphics"
  ],
  "brand_safety": [
    "Family-friendly",
    "Mild language"
  ],
  "brand_type": "Tech brands",
  "brand_names": [
    "Xiaomi",
    "iPhone",
    "Leica",
    "Shopee",
    "Instagram",
    "Pinterest",
    "YouTube",
    "TikTok"
  ],
  "transcript": "My personal experience pakai Xiaomi 17 Promax. Ini test zoom camera belakang, I think it's pretty good and pretty HD. Tapi my favorite feature pastinya screen belakang ini. Ini tuh lucu banget, tapi pastinya tetap berguna because, ini juga bisa mirror screen buat kalian yang mau selfie pakai camera belakang. Overall, the phone is really fast dan udah nggak nge-hang lagi kayak Android zaman dulu. Aku shoot video ini pakai iPhone 12 Pro Max. Kalian bisa lihat sendiri perbedaan warnanya, lumayan kelihatan beda color contrastnya antara iPhone dan Xiaomi. Tapi aku masih suka kualitas videonya yang terang dan jernih. Ini adalah beberapa hasil selfie aku dari Xiaomi 17 Promax. HD & jernih tapi ga fokus ke pori-pori / makeup cakey! Zoom lebih smooth & stabil. As a girl yang suka content creating, HP ini bener-bener cocok banget untuk aku. Dan so far aku nggak nyesel sama sekali changing from Apple to Xiaomi."
}